00_simpleFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    C
    {
        solver         smoothSolver;
        smoother       GaussSeidel;
        tolerance 1e-7; 
        relTol  0.05;
    }

    "(U|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }
    pFinal
	{
		$p;
		relTol 0;
	}
    "(U|k|epsilon|omega)Final"
	{
		$U;
		relTol 0;
	}
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|epsilon|omega|f|v2)" 1e-4;
		C				1e-10;
    }
}

PIMPLE
{
  nNonOrthogonalCorrectors 0;
  nCorrectors 2;
}

relaxationFactors
{
    equations
    {
        U           0.8; // 0.9 is more stable but 0.95 more convergent
	    p 	        0.7; 
        C           1.0; 
       // ".*"            0.8; // 0.9 is more stable but 0.95 more convergent
    }
}


// ************************************************************************* //
